Tekla Open API Reference for Tekla Structures 2025
RadiusDimensionAttributes Constructor
Overload List
Name | Description
RadiusDimensionAttributes()
 Creates a new radius dimension attributes instance which loads standard attributes.
RadiusDimensionAttributes(String)
 Creates a new radius dimension attributes instance that loads the specified attributes.
Top
See Also
Reference
RadiusDimensionAttributes Class
Tekla.Structures.Drawing Namespace